package dev.yarashevich.dzmitry.model;

public abstract class Config {

    //    Корабли и их конфигурация
    private static final String[][] SHIPS = {
//            {"1", "Корабль-6", "6"},
//            {"2", "Корабль-5.1", "5"}, {"7", "Корабль-5.2", "5"},
//            {"3", "Корабль-4.1", "4"}, {"8", "Корабль-4.2", "4"}, {"9", "Корабль-4.3", "4"},
//            {"4", "Корабль-3.1", "3"}, {"10", "Корабль-3.2", "3"}, {"11", "Корабль-3.3", "3"}, {"12", "Корабль-3.4", "3"},
//            {"5", "Корабль-2.1", "2"}, {"13", "Корабль-2.2", "2"}, {"14", "Корабль-2.3", "2"}, {"15", "Корабль-2.4", "2"},
//            {"16", "Корабль-2.5", "2"},
//            {"6", "Корабль-1.1", "1"}, {"17", "Корабль-1.2", "1"}, {"18", "Корабль-1.3", "1"}, {"19", "Корабль-1.4", "1"},
//            {"20", "Корабль-1.5", "1"}, {"21", "Корабль-1.6", "1"}
            {"1", "Корабль-2", "1"},
            {"2", "Корабль-1", "1"}
    };

    //    Возвращает конфигурацию заданного корабля
    public static String[] getShipsConfig(int shipId) {
        if (shipId < 0 || shipId >= SHIPS.length) {
            return new String[0];
        }
        return SHIPS[shipId];
    }

    //    Возвращает конфигурацию всех кораблей
    public static String[][] getShipsConfig() {
        return SHIPS;
    }

    //    Возвращает количество кораблей
    public static int getNbShips() {
        return SHIPS.length;
    }
}